src/Documents/КассовыйЧек/КассовыйЧек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КассовыйЧек</name>
  <basedOn>Document.ПлатежноеПоручение</basedOn>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипОперацииЧека</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПлатежноеПоручение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФискальныйАттрибут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обработан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеУдаленное</name>
    <type>
      <types>DocumentRef.ПлатежноеПоручение</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСмены</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЧека</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерКвитанции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.ВидОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>13</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/КассовыйЧек/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
function СписокНомеровКвитанции()
	
	return new array;
	
endfunction

&AtClientAtServerNoContext
procedure CaclSum(Form)
	Summ = 0;
	
	for each row in Form.Объект.Товары do
		Summ = Summ + row.Сумма;
	endDo;
	Form.Сумма = Summ;
	
endprocedure	

&AtServer
procedure SetVisibleItems()
	Items.ГруппаФискальный.Visible = Объект.Обработан;
	ReadOnly = Объект.Обработан;
endprocedure	
////////////////////////////////////////////////////////////////////
//    обработчики элементов формы
//

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	CaclSum(thisObject);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНомерКвитанцииНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	list = СписокНомеровКвитанции();
	Элемент.СписокВыбора.LoadValues( list );
КонецПроцедуры


////////////////////////////////////////////////////////////////////
//  обработчики событий формы
//

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	CaclSum(thisObject);
	SetVisibleItems();
КонецПроцедуры
